Public Attributes | List of all members
API_ElemComponentID Struct Reference
Element Manager
Identifies a component of an element. More...
#include <APIdefs_Component.h>
 Public Attributes
 API_Guid  | elemGuid
Guid of the element. componentID identifies a component that belongs to it.
 API_ComponentID  | componentID
Identifier of the component.
Detailed Description
Identifies a component of an element.